Revit 2015 API
IFCTypeInfo.Get3DMapHandle Method
 Gets the associated handle to a 3D IfcRepresentationMap for the type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public IFCAnyHandle Get3DMapHandle()
Visual Basic
Public Function Get3DMapHandle As IFCAnyHandle
Visual C++
public:
IFCAnyHandle^ Get3DMapHandle()
Return Value
 The handle.
Remarks
 Typically used only for Building Element Proxy elements (masses).
See Also
IFCTypeInfo Class
Autodesk.Revit.DB.IFC Namespace